[{"id":131191630,"parent_id":131191579,"name":"Express-MongoDB","slug":"express-mongodb","full_slug":"boilerplates/express-mongodb","title":"Express-MongoDB","summary":"Example project of an express server that handles a user registration flow and stores user data in a MongoDB Database.","descriptions":["Users can register for an account, login with it, logout or delete their account.\nThe user data is stored in a MongoDB atlas database."],"technologies":["HTML","CSS","JS","Node.js","EJS","Liquid","MongoDB","Express","SASS"]},{"id":131191613,"parent_id":131191579,"name":"MongoDB","slug":"mongodb","full_slug":"boilerplates/mongodb","title":"MongoDB","summary":"Just a simple example repo for usage of MongoDB Atlas database.","descriptions":["Last term I helped out at the Project Tech-semester at Communication and Multimedia Design at the Amsterdam University of Applied Sciences.","To be able to help the students more quickly with tutoring, I created this repository with a project that makes use of MongoDB Atlas databases in a 'simple' and more understandable way."],"technologies":["HTML","CSS","JS","Express","MongoDB","Node.js","Sockets.js","EJS","SASS"]},{"id":131191591,"parent_id":131191579,"name":"Code Cookbook Template","slug":"code-cookbook-template","full_slug":"boilerplates/code-cookbook-template","title":"Code Cookbook Template","summary":"Template for project documentation and guideline to the best practices for building and deploying webapplications.","descriptions":["This website can be used as a dev- and design reference for both new and ongoing projects.","Part of this documentation tool consists of general guidelines and agreements that apply to several projects. These will be marked as separate in a next version and their display will be toggled.","Furthermore, part of this documentation is project-specific: information required for the handoff from design to development, project documentation, required files etc."],"technologies":["HTML","JS","CSS","Node.js","Eleventy.js","D3.js","Liquid"]},{"id":131191414,"parent_id":131191579,"name":"11ty-CMS-boilerplate","slug":"11ty-cms-boilerplate","full_slug":"boilerplates/11ty-cms-boilerplate","title":"11ty-CMS-boilerplate","summary":"Boilerplate for linking a headless CMS with a statically generated site.","descriptions":["A boilerplate-repository that contains a connection with NetlifyCMS as headless CMS, a script that generates a SCSS variables file from Figma design tokens. Site is generated using Eleventy Static Site Generator."],"technologies":["HTML","CSS","Node.js","Eleventy.js","JS","EJS"]}]